antoinecellerier/firebeetle-esp32-e-thermometer/src/Thermometer.cpp
  // Keep only samples with a real measurement window. maybe_ntp_resync() never
  // records one below DRIFT_MIN_WINDOW_S, so a zero window means corrupt or
  // synthetic data; it contributes nothing to the window-weighted mean but
  // would still inflate the "nN" sample count on screen.
  drift_ppm_count = 0;
  memset(drift_ppm_hist, 0, sizeof(drift_ppm_hist));
  memset(drift_win_min, 0, sizeof(drift_win_min));
  uint8_t n = d->drift_ppm_count;
  if (n > DRIFT_PPM_HIST_SIZE) n = DRIFT_PPM_HIST_SIZE;
  for (uint8_t i = 0; i < n; i++)
  {
    if (d->drift_win_min[i] == 0) continue;
    drift_win_min[drift_ppm_count] = d->drift_win_min[i];
    drift_ppm_hist[drift_ppm_count++] = d->drift_ppm_hist[i];
  }

  if (trust_clock)
    last_sync_time = (time_t)d->last_sync_time;
}

// Longest gap still attributed to a missed safety-net wake rather than to the
// device being off. The safety net fires hourly, so this allows exactly one
// miss; beyond it, skipped hours are marked HOURLY_NO_DATA instead of repeating
// the last reading.
#define HOURLY_REPEAT_FILL_MAX 2

// Write one finalized entry into the ring and mirror it to the flash archive.
// Every ring write goes through here so the two can never diverge.
static void hourly_append(time_t hour_start, const HourlyEntry &entry)
{
  historical_data.hourly[historical_data.hourly_idx] = entry;
  historical_data.hourly_idx = (historical_data.hourly_idx + 1) % HOURLY_HISTORY_SIZE;
  if (historical_data.hourly_count < HOURLY_HISTORY_SIZE)
    historical_data.hourly_count++;
  history_store_append_hourly(hour_start, &entry);
}

// Update the hourly history buffer with a new temperature reading.
// Called on every main CPU wake (both delta-triggered and safety-net timer).
// When the clock hour changes, the accumulated entry is finalized and appended
// to the circular buffer. Any skipped hours (shouldn't happen normally since
// the safety net wakes every hour) are filled with sentinel entries.
static void update_hourly_history(time_t now, const struct tm *nowtm, float temp)
{
  // Nothing here is meaningful without a wall clock: entries are filed by clock
  // hour, and a 1970 timestamp would file them ~54 years before everything
  // already stored. Recording nothing (and letting the `! NOSYNC` badge explain
  // the stall) beats recording lies — before this guard an unsynced device
  // wrote 1970-stamped entries, and the eventual forward step filled the whole
  // ring with one repeated value.
  if (!time_is_plausible(now))
    return;

  int16_t temp_x10 = (int16_t)(temp * 10);

  // Compute wall-clock start-of-hour for current local time
  struct tm hour_tm = *nowtm;
  hour_tm.tm_min = 0;
  hour_tm.tm_sec = 0;
  time_t hour_start = mktime(&hour_tm);

  // Finalize only when the clock has moved into a genuinely later hour than
  // anything already stored. An NTP resync correcting a slow RTC steps the
  // clock BACKWARDS (−9559s on the ESP32-E, docs/clock-drift.md): the negative
  // hours_elapsed below already skips the fill, but a plain "hour changed"
  // test would still advance hourly_idx while moving hourly_latest_time
  // backwards, permanently offsetting the index→time mapping in Display.h that
  // every later entry inherits. Re-lived hours therefore keep accumulating
  // into the current entry and produce exactly one entry once the clock passes
  // the newest stored hour again — no duplicate, no gap.
  bool hour_advanced = historical_data.current_hour_start != 0 &&
                       hour_start > historical_data.current_hour_start;
  bool extends_history = (hour_start - 3600) > historical_data.hourly_latest_time;
  if (hour_advanced && extends_history)
  {
    // Clock hour changed — finalize the completed hour's entry
    HourlyEntry entry;
    entry.min_x10 = historical_data.current_hour_min_x10;
    entry.max_x10 = historical_data.current_hour_max_x10;
    entry.avg_x10 = (historical_data.current_hour_sample_count > 0)
      ? (int16_t)(historical_data.current_hour_sum_x10 / historical_data.current_hour_sample_count)
      : historical_data.current_hour_min_x10;

    hourly_append(historical_data.current_hour_start, entry);

    // Fill any skipped hours.
    // Uses time_t difference (UTC-based) so DST transitions are handled
    // correctly — a "spring forward" skip produces one fill, a "fall back"
    // repeat produces hours_elapsed=0 (no fill needed).
    int hours_elapsed = (int)((hour_start - historical_data.current_hour_start) / 3600);
    if (hours_elapsed > HOURLY_HISTORY_SIZE)
      hours_elapsed = HOURLY_HISTORY_SIZE;

    // A short gap means the ULP safety-net woke but no delta was detected, so
    // temperature was stable and the last known value is the best estimate. A
    // long one means the device was not running at all — a battery swap, a
    // reflash, or a restore from flash — and repeating the last value there
    // would draw a flat line across days the device never measured. The safety
    // net fires hourly, so anything past one missed wake is the second case.
    HourlyEntry gap = entry;
    if (hours_elapsed > HOURLY_REPEAT_FILL_MAX)
      gap.min_x10 = gap.max_x10 = gap.avg_x10 = HOURLY_NO_DATA;

    for (int i = 1; i < hours_elapsed; i++)
      hourly_append(historical_data.current_hour_start + (time_t)i * 3600, gap);

    // Update reference time: the last written entry's start-of-hour
    historical_data.hourly_latest_time = hour_start - 3600;

    // Reset accumulator for the new hour
    historical_data.current_hour_sum_x10 = 0;
    historical_data.current_hour_sample_count = 0;
    historical_data.current_hour_min_x10 = TEMP_INIT_MIN_X10;
    historical_data.current_hour_max_x10 = TEMP_INIT_MAX_X10;
  }

  // First reading after boot.
  if (historical_data.current_hour_start == 0)
  {
    if (historical_data.hourly_count == 0)
    {
      // Nothing stored. The anchor names the newest *finalized* entry and there
      // are none yet, so it sits one hour before the in-progress hour; the first
      // finalize then lands on the boot hour and extends_history is satisfied.
      historical_data.hourly_latest_time = hour_start - 3600;
    }
    else if (hour_start > historical_data.hourly_latest_time + 3600)
    {
      // History came back from flash. hourly_latest_time dates the ENTIRE ring —
      // Display.h derives every entry's hour by counting back from it — so
      // overwriting it with this boot's hour would silently re-date 30 days of
      // archived readings and land the derived daily columns on the wrong days.
      // Keep it, and mark the hours the device was off. The finalize path above
      // cannot do this: by the time it next runs, current_hour_start is only one
      // hour back, so hours_elapsed is 1 and no fill happens.
      int gap = (int)((hour_start - historical_data.hourly_latest_time) / 3600) - 1;
      if (gap > HOURLY_HISTORY_SIZE)
        gap = HOURLY_HISTORY_SIZE;
      // Counting back from hour_start rather than forward from the anchor keeps
      // the newest fill adjacent to the in-progress hour even when the outage
      // outran the ring, which is what the anchor must name.
      HourlyEntry nodata = { HOURLY_NO_DATA, HOURLY_NO_DATA, HOURLY_NO_DATA };
      for (int i = gap; i >= 1; i--)
        hourly_append(hour_start - (time_t)i * 3600, nodata);
      historical_data.hourly_latest_time = hour_start - 3600;
    }
    // Otherwise the clock has not passed the newest stored hour (a restored
    // future-dated archive, or drift): leave the anchor alone and let the
    // extends_history guard absorb the re-lived hours.
  }

  historical_data.current_hour_start = hour_start;

  // Accumulate reading into current hour's stats
  historical_data.current_hour_sample_count++;
  historical_data.current_hour_sum_x10 += temp_x10;
  if (temp_x10 < historical_data.current_hour_min_x10)
    historical_data.current_hour_min_x10 = temp_x10;
  if (temp_x10 > historical_data.current_hour_max_x10)
    historical_data.current_hour_max_x10 = temp_x10;
}

static void update_temp_extremes(float temp)
{
  if (temp < min_temp_since_boot)
    min_temp_since_boot = temp;
  if (temp > max_temp_since_boot)
    max_temp_since_boot = temp;
}

// Do any deferred flash work now. Every path into deep sleep goes through here
// — the normal one and the permanent shutdown — so the two can't diverge.
// Appends already happened inline (a page program is ~0.04mC); this is the
// ~4.5mC base snapshot, and it only fires when marked dirty.
//
// Deliberately a single point so it is trivial to isolate on a PPK2 trace: it
// is the last thing in the active phase, right before PPK2_CPU_ACTIVE_LOW().
// Build with -DHISTORY_BASE_EVERY_WAKE to force one per wake and measure the
// delta against a normal wake.
static void history_store_persist_now()
{
  HistoryDriftState drift;
  drift_state_save(&drift);
  time_t now;
  time(&now);
#ifdef HISTORY_BASE_EVERY_WAKE
  history_store_mark_base_dirty();
#endif
  // Reuses the display marker (D11/GPIO16 → PPK2 D1): rendering is finished by
  // the time this runs, so the two can never overlap in a trace, and the flash
  // write gets a crisp bracket instead of being an unlabelled plateau at the
  // tail of the active phase.
  //
  // Three 50ms pulses first, as a signature. The pin is not held across deep
  // sleep (no gpio_hold_en), so it floats while asleep and its idle level on a
  // PPK2 input is whatever the input does — which makes a lone edge ambiguous
  // to read. A triple blip immediately before the write is unmistakable at any
  // polarity, and the flash write is the excursion right after it.
  //
  // 50ms, not 2ms: at the 3s window needed to see a whole wake, 2ms pulses are
  // ~1px each and invisible. 300ms of preamble is ~10% of that width, so it can
  // be found zoomed out and then zoomed into.
  //
  // The #ifdef is load-bearing, not decoration: PPK2_DISPLAY_HIGH/LOW compile to
  // nothing without PPK2_DEBUG but sleep_ms() does not, so leaving the loop
  // unguarded put 300ms of awake time on EVERY wake of a normal build — ~0.6C/day
  // against a ~7.1C/day budget, and silently, since the markers it existed to
  // emit were no-ops.
#ifdef PPK2_DEBUG
  for (int i = 0; i < 3; i++)
  {
    PPK2_DISPLAY_HIGH();
    sleep_ms(50);
    PPK2_DISPLAY_LOW();
    sleep_ms(50);
  }
#endif
  PPK2_DISPLAY_HIGH();
  history_store_flush(&historical_data, &drift, now);
  PPK2_DISPLAY_LOW();
}

