antoinecellerier/firebeetle-esp32-e-thermometer/src/Thermometer.cpp
  // Capture pre-sync time for drift measurement
  time_t before_sync;
  time(&before_sync);

  // Fresh SNTP instance waits for a genuinely new time response. The clock is
  // already set (just drifted), so anything that returns early on a valid-
  // looking clock would measure ~0 drift and never actually correct it.
  if (!sntp_sync_once(30000U))
  {
    resync_fail_count++;
    LOGI("NTP resync: sync failed (%u in a row), deferring to next scheduled resync",
         (unsigned)resync_fail_count);
    wifi_disconnect();
    next_resync_time = now + resync_interval_s;
    return;
  }

  time_t after_sync;
  time(&after_sync);

  // Window the drift accumulated over: since the clock was last *set* (boot
  // sync or a previous successful resync), not since the last attempt. Failed
  // attempts re-arm at +resync_interval_s, so the interval setting understates
  // the span by a whole multiple after every failure.
  time_t last_set = (last_sync_time > 0) ? last_sync_time : first_boot_time;
  last_drift_window_s = (int32_t)(before_sync - last_set);
  last_sync_time = after_sync;

  // Drift = what the clock said before sync minus what NTP says now.
  // Positive = clock was ahead, negative = clock was behind.
  // after_sync is the corrected time; before_sync was the drifted time.
  last_drift_ms = (int32_t)(before_sync - after_sync) * 1000;
  // Rate in ppm, kept with its window as a short history so the screen can
  // show whether the oscillator error is a stable constant. Short windows are
  // dropped rather than averaged in — see DRIFT_MIN_WINDOW_S.
  if (last_drift_window_s >= DRIFT_MIN_WINDOW_S)
  {
    int32_t ppm = (int32_t)((last_drift_ms * 1000LL) / last_drift_window_s);
    ppm = (ppm > 32767) ? 32767 : (ppm < -32768 ? -32768 : ppm);
    int32_t win_min = last_drift_window_s / 60;
    if (win_min > 65535) win_min = 65535;  // saturates at 45 days
    if (drift_ppm_count == DRIFT_PPM_HIST_SIZE)
    {
      memmove(drift_ppm_hist, drift_ppm_hist + 1,
              sizeof(drift_ppm_hist) - sizeof(drift_ppm_hist[0]));
      memmove(drift_win_min, drift_win_min + 1,
              sizeof(drift_win_min) - sizeof(drift_win_min[0]));
      drift_ppm_count--;
    }
    drift_win_min[drift_ppm_count] = (uint16_t)win_min;
    drift_ppm_hist[drift_ppm_count++] = (int16_t)ppm;
    LOGI("NTP resync: rate %d ppm over %d min (%u samples retained)",
         (int)ppm, (int)win_min, (unsigned)drift_ppm_count);
  }

  LOGI("NTP resync: drift was %d ms over %d s (%u attempts failed since last sync)",
       (int)last_drift_ms, (int)last_drift_window_s, (unsigned)resync_fail_count);

  // Journal the observation before clearing resync_fail_count, and snapshot the
  // drift block at the next sleep. Between them this is what docs/clock-drift.md
  // asks to be transcribed off the screen daily: the retained ppm ring holds
  // only DRIFT_PPM_HIST_SIZE (6) samples and dies on any reflash, whereas the
  // archive keeps every one of them with its correlates.
  {
    HistoryDriftSample s = {};
    s.sync_time = last_sync_time;
    s.drift_ms = last_drift_ms;
    s.window_s = last_drift_window_s;
    s.ppm = (last_drift_window_s >= DRIFT_MIN_WINDOW_S && drift_ppm_count > 0)
                ? drift_ppm_hist[drift_ppm_count - 1] : 0;
    // Absolute, not deltas: the host differences consecutive records, so no RTC
    // variable has to remember the previous values.
    s.boot_count = (uint32_t)boot_count;
    s.refresh_count = (uint32_t)display_refresh_count;
    s.ambient_mean_x10 = window_mean_ambient_x10(last_drift_window_s, &s.ambient_hours);
    history_store_append_drift(&s);
  }
  history_store_mark_base_dirty();

  resync_fail_count = 0;

#ifdef RESYNC_INTERVAL_OVERRIDDEN
  // Pinned. The override exists to sample resyncs on a fixed short cadence, and
  // the adaptive rule below would defeat that: a bench rig that was just synced
  // shows negligible drift, so the interval doubles after every success —
  // 300s, 600, 1200, 2400, 4800 — and is back over four hours within five
  // wall-clock hours, yielding a handful of geometrically-spaced samples instead
  // of the steady cadence that was asked for.
  resync_interval_s = RESYNC_INTERVAL_MIN;
  LOGI("NTP resync: interval pinned at %d s by build override (adaptation off)",
       (int)resync_interval_s);
#else
  // Only shorten the interval if drift is significant (>= 1 minute).
  // For a low-fidelity EPD thermometer display, sub-minute drift is invisible.
  int32_t abs_drift = abs(last_drift_ms);
  if (abs_drift >= 60000)
  {
    // Aim for <60s drift at next resync. The rate is drift over the measured
    // window, not over the interval setting — using the setting after a run of
    // failed attempts overstates the rate and shortens the interval too far.
    int32_t target = (int32_t)((60LL * last_drift_window_s * 1000) / abs_drift);
    if (target < RESYNC_INTERVAL_MIN)
      target = RESYNC_INTERVAL_MIN;
    if (target > RESYNC_INTERVAL_MAX)
      target = RESYNC_INTERVAL_MAX;
    resync_interval_s = target;
    LOGI("NTP resync: significant drift, interval adjusted to %d s (%d h)",
         (int)resync_interval_s, (int)(resync_interval_s / 3600));
  }
  else
  {
    // Drift < 1 minute — double the interval (capped)
    if (resync_interval_s < RESYNC_INTERVAL_MAX / 2)
      resync_interval_s *= 2;
    else
      resync_interval_s = RESYNC_INTERVAL_MAX;
    LOGI("NTP resync: drift negligible, extending interval to %d s (%d h)",
         (int)resync_interval_s, (int)(resync_interval_s / 3600));
  }
#endif // RESYNC_INTERVAL_OVERRIDDEN

  wifi_disconnect();
  next_resync_time = after_sync + resync_interval_s;
}
#endif // DISABLE_WIFI

// Battery thresholds (mV).
#if defined(ARDUINO_XIAO_ESP32C6)
// The XIAO's 3V3 rail is a pure buck (SGM6029C): at VBAT ≤3.6V it enters a
// bootstrap-starvation sag band (rail sags ~VTH below VIN; wakes collapse it
// into 0.5-0.9A brownout-restart storms; 30Hz sawtooth at 3.3V). Fine sweep
// 2026-07-05 (docs/notes.md): 3.7V is the lowest verified-healthy point,
// 3.6V is already inside the sag band — so shut down at the electrical
// cliff, not the battery's own limit (~12-15% SoC abandoned per OCV curve).
// The custom thermometer-c6 board (RT9080 LDO, not a buck) keeps the same
// numbers: worst-case LDO dropout at the refresh peak sits right at this
// cutoff, and SCHEMATIC-VERIFICATION.md says keep shutdown ≥3.6V pending
// the first-article dropout measurement.
const uint32_t low_battery_mv = 3800;
const uint32_t no_battery_mv = 3700;
#else
// https://dlnmh9ip6v2uc.cloudfront.net/datasheets/Prototyping/TP4056.pdf
// https://www.best-microcontroller-projects.com/tp4056.html
const uint32_t low_battery_mv = 3200;
const uint32_t no_battery_mv = 3000; // Controller stops delivering current at 2.9V
#endif

uint32_t read_battery_level()
{
#if defined(ARDUINO_DFROBOT_FIREBEETLE_2_ESP32E)
  // https://dfimg.dfrobot.com/nobody/wiki/fd28d987619c16281bdc4f40990e5a1c.PDF => looks like 1M/1M divider == x2 ratio
  // GPIO34 (A2) = ADC1 channel 6
  // On ADC failure return a value in the low-battery band: visible on the
  // display as a warning, but above no_battery_mv so a transient ADC error
  // can never trigger the permanent shutdown in handle_permanent_shutdown().
  const uint32_t adc_fail_mv = 3100;

