antoinecellerier/firebeetle-esp32-e-thermometer/src/Thermometer.cpp
static void ppk2_selftest()
{
  // INPUT_OUTPUT, not OUTPUT: gpio_config() with GPIO_MODE_OUTPUT disables the
  // input buffer on ESP32, so gpio_get_level() would always read 0.
  gpio_config_t cfg = {};
  cfg.pin_bit_mask = (1ULL << PPK2_PIN_CPU_ACTIVE) | (1ULL << PPK2_PIN_DISPLAY);
  cfg.mode = GPIO_MODE_INPUT_OUTPUT;
  gpio_config(&cfg);

  gpio_set_level((gpio_num_t)PPK2_PIN_CPU_ACTIVE, 1);
  gpio_set_level((gpio_num_t)PPK2_PIN_DISPLAY, 1);
  int d0_hi = gpio_get_level((gpio_num_t)PPK2_PIN_CPU_ACTIVE);
  int d1_hi = gpio_get_level((gpio_num_t)PPK2_PIN_DISPLAY);
  gpio_set_level((gpio_num_t)PPK2_PIN_CPU_ACTIVE, 0);
  gpio_set_level((gpio_num_t)PPK2_PIN_DISPLAY, 0);
  int d0_lo = gpio_get_level((gpio_num_t)PPK2_PIN_CPU_ACTIVE);
  int d1_lo = gpio_get_level((gpio_num_t)PPK2_PIN_DISPLAY);
  LOGI("PPK2 selftest: D0=GPIO%d %d->%d, D1=GPIO%d %d->%d — pads %s",
       PPK2_PIN_CPU_ACTIVE, d0_hi, d0_lo, PPK2_PIN_DISPLAY, d1_hi, d1_lo,
       (d0_hi && !d0_lo && d1_hi && !d1_lo) ? "follow (firmware OK)"
                                            : "DO NOT follow (firmware fault)");

  for (int i = 0; i < PPK2_FP_CPU_PULSES; i++)
  {
    gpio_set_level((gpio_num_t)PPK2_PIN_CPU_ACTIVE, 1); sleep_ms(PPK2_FP_CPU_MS);
    gpio_set_level((gpio_num_t)PPK2_PIN_CPU_ACTIVE, 0); sleep_ms(PPK2_FP_CPU_MS);
  }
  for (int i = 0; i < PPK2_FP_DISP_PULSES; i++)
  {
    gpio_set_level((gpio_num_t)PPK2_PIN_DISPLAY, 1); sleep_ms(PPK2_FP_DISP_MS);
    gpio_set_level((gpio_num_t)PPK2_PIN_DISPLAY, 0); sleep_ms(PPK2_FP_DISP_MS);
  }
}
#endif

void setup()
{
  // Must run before anything that can light-sleep (see s_wake_cause).
  s_wake_causes_raw = app_wakeup_causes_raw();
  s_wake_cause = app_wakeup_cause();

  setup_serial();
  crash_forensics_on_boot();

#if defined(HAS_ULP_SUPPORT) && defined(SOC_ULP_FSM_SUPPORTED)
  ulp_check_data_overlap();  // abort immediately if ULP data overlaps RTC variables
#endif

#ifdef PPK2_DEBUG
  gpio_out_init(PPK2_PIN_CPU_ACTIVE);
  gpio_out_init(PPK2_PIN_DISPLAY);
#endif
  // Before the fingerprint, not after: a marker raised afterwards excludes the
  // fingerprint plus everything earlier in startup. Measured on the C6 ePaper rig,
  // raising it late hid ~450ms at 10-20mA (~5-9 mC) from every wake figure the
  // marker bounded.
  PPK2_CPU_ACTIVE_HIGH();
#ifdef PPK2_DEBUG
  ppk2_selftest();
  PPK2_CPU_ACTIVE_HIGH();     // the fingerprint leaves the pad low
#endif

  // Detect stale RTC memory from a different firmware version.
  // Three checks: version tag mismatch (format changed), address shift
  // (linker moved the struct due to other RTC variable changes), and
  // state version mismatch (non-history RTC variables changed).
  if (historical_data.version != RTC_HISTORY_VERSION ||
      historical_data.self_addr != (uint32_t)&historical_data)
  {
    if (historical_data.version != RTC_HISTORY_VERSION)
      LOGI("RTC history version mismatch — resetting history");
    else
      LOGI("RTC history address shifted (was 0x%08x, now 0x%08x) — resetting history",
           (unsigned)historical_data.self_addr, (unsigned)(uint32_t)&historical_data);
    reset_rtc_history();
    reset_rtc_state();
    restore_history_from_flash();  // must run last: reset_rtc_state() would
                                   // otherwise clobber the restored drift block
  }
  else if (rtc_state_version != RTC_STATE_VERSION)
  {
    LOGI("RTC state version mismatch — resetting state (history preserved)");
    reset_rtc_state();
    restore_drift_from_flash();  // history survived; the drift block did not
  }

  boot_count++;
  crash_log.cur_boot_count = boot_count;
  // CPU frequency is fixed at 80 MHz at build time (CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ)
  // — replaces the Arduino-era setCpuFrequencyMhz(80) on non-first boots.

  LOGI("Boot count: %d [%s] sizeof(TempReading)=%d sizeof(time_t)=%d",
       boot_count, GIT_HASH, (int)sizeof(TempReading), (int)sizeof(time_t));

  // Diagnostic: dump sparkline buffer to detect packed struct corruption
  if (historical_data.temp_count > 0)
  {
    LOGI("Sparkline: count=%d", historical_data.temp_count);
    for (int i = 0; i < historical_data.temp_count; i++)
    {
      LOGI("  [%d] ts=%lld temp_x10=%d",
           i,
           (long long)historical_data.temp[i].timestamp,
           (int)historical_data.temp[i].temp_x10);
    }
  }

  esp_sleep_wakeup_cause_t wakeup_cause = s_wake_cause;
  LOGI("Wakeup caused by %d (raw 0x%x)", (int)wakeup_cause, (unsigned)s_wake_causes_raw);

  uint32_t battery_mv = read_battery_level();

  handle_permanent_shutdown(battery_mv);

  if ((wakeup_cause == ESP_SLEEP_WAKEUP_ULP || wakeup_cause == ESP_SLEEP_WAKEUP_TIMER)
      && sensor.SupportsUlp())
  {
    float temp;
    crash_log.stage = STAGE_ULP_READ;
    if (sensor.ReadUlpTemperature(&temp, previous_temp))
    {
      last_sensor_ok = true;
      refresh_and_sleep(battery_mv, temp);
      return; // never reached
    }
    // ULP I2C error — fall through to normal sensor read
    last_sensor_ok = false;
  }

  if (boot_count == 1)
  {
    initialize_status_led();
    on_first_boot();
    clear_status_led(); // TODO: double check that this stops drawing power
  }

#ifdef MOCK_DISPLAY_DATA
  // Fill mock data if history is empty (handles both first boot and stale RTC
  // memory after firmware upload without power-cycle)
  if (historical_data.temp_count == 0)
  {
    time_t mock_now;
    struct tm mock_nowtm;
    get_time(&mock_now, &mock_nowtm);
    fill_mock_data(mock_now);
    // Force display refresh by invalidating previous_temp
    previous_temp = TEMP_NO_PREVIOUS;
  }
#endif

  crash_log.stage = STAGE_SENSOR;
  float temp = read_temperature();
  refresh_and_sleep(battery_mv, temp);
}

extern "C" void app_main(void)
{
  setup(); // deep-sleeps at the end; never returns
}
